ERP DEV.WMS/src/DataProcessors/вмс_ИнвентаризацияПоОстаткамВЯчейках/вмс_ИнвентаризацияПоОстаткамВЯчейках.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>вмс_ИнвентаризацияПоОстаткамВЯчейках</name>
  <comment>Заполняет остатки товаров в типовом документе по текущим остаткам в ячейках</comment>
</mdclass:DataProcessor>

ERP DEV.WMS/src/InformationRegisters/вмс_СоответствиеОбъектамУчета/вмс_СоответствиеОбъектамУчета.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>вмс_СоответствиеОбъектамУчета</name>
  <resources>
    <name>ЗначениеУчета</name>
    <type>
      <types>CatalogRef.СерииНоменклатуры</types>
    </type>
  </resources>
  <dimensions>
    <name>ЗначениеВМС</name>
    <type>
      <types>CatalogRef.вмс_СерииНоменклатуры</types>
      <types>CatalogRef.вмс_ПартииНоменклатуры</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

ERP DEV.WMS/src/AccumulationRegisters/вмс_ОперацияПоЯчейкам/вмс_ОперацияПоЯчейкам.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>вмс_ОперацияПоЯчейкам</name>
  <resources>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>14</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Вес</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>14</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ПланируемыйРасход</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ПланируемыйПриход</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>Сторно</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <dimensions>
    <name>Ячейка</name>
    <type>
      <types>CatalogRef.вмс_МестаХранения</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Контейнер</name>
    <type>
      <types>CatalogRef.вмс_Контейнеры</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Товар</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Характеристика</name>
    <type>
      <types>DefinedType.вмс_ХарактеристикиНоменклатуры</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Серия</name>
    <type>
      <types>CatalogRef.вмс_СерииНоменклатуры</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Партия</name>
    <type>
      <types>CatalogRef.вмс_ПартииНоменклатуры</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Упаковка</name>
    <type>
      <types>CatalogRef.УпаковкиЕдиницыИзмерения</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Качество</name>
    <type>
      <types>EnumRef.вмс_КачествоТовара</types>
    </type>
  </dimensions>
  <dimensions>
    <name>удалитьАналитика</name>
    <type>
      <types>CatalogRef.вмс_АналитикаУчетаНоменклатуры</types>
    </type>
  </dimensions>
  <dimensions>
    <name>удалитьУчетныйПараметр1</name>
    <type>
      <types>Characteristic.вмс_СоответствиеМетаданных</types>
    </type>
  </dimensions>
  <dimensions>
    <name>удалитьУчетныйПараметр2</name>
    <type>
      <types>Characteristic.вмс_СоответствиеМетаданных</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

ERP DEV.WMS/src/DataProcessors/вмс_ИнвентаризацияПоОстаткамВЯчейках/Forms/Форма/Module.bsl
&НаКлиенте
Процедура ЗаполнитьОстатки(Команда)
	Если ЗначениеЗаполнено(ДокументОснование) Тогда
		ДокументИнвентаризацииЗаполнен = ЗаполнитьФактИнвентаризации();  
		
		Если ДокументИнвентаризацииЗаполнен Тогда
			ОбщегоНазначенияКлиент.СообщитьПользователю(Строка(ДокументОснование) + " успешно изменен!");	
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры 

&НаСервере
Функция ЗаполнитьФактИнвентаризации() 
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Ссылка", ДокументОснование);	
	Запрос.УстановитьПараметр("ИспользуютсяСерии", ИспользуютсяСерии);
	
	Запрос.Текст = ТекстЗапросаТовары();
	ТаблицаТоваров = Запрос.Выполнить().Выгрузить();

	Запрос.Текст = ТекстЗапросаОстатковПоЯчейкам();
	Запрос.УстановитьПараметр("ТаблицаТоваров", ТаблицаТоваров); 
	Запрос.УстановитьПараметр("Склад", ?(ЭтоУТ, ДокументОснование.Склад, ДокументОснование.СтруктурнаяЕдиница));
	
	ОстаткиТоваровВЯчейках = Запрос.Выполнить().Выгрузить();
	
	ДокументОбъект = ДокументОснование.ПолучитьОбъект();  
	
	Если ЭтоУТ Тогда
		
		Шаблон = ДокументОбъект.Товары.Выгрузить();
		
		Для каждого Строка Из ОстаткиТоваровВЯчейках Цикл
			
			Отбор = Новый Структура();
			Отбор.Вставить("Номенклатура", 	 Строка.Номенклатура); 
			Отбор.Вставить("Характеристика", Строка.Характеристика); 
			
			Если ИспользуютсяСерии Тогда
				Отбор.Вставить("Серия", Строка.Серия);			
			КонецЕсли;       
			
			НайденныеСтроки = Шаблон.НайтиСтроки(Отбор); 
			
			Для каждого НайденнаяСтрока Из НайденныеСтроки Цикл
				
				Если НайденнаяСтрока.КоличествоФакт = 0 И Строка.КоличествоОстаток = 0 Тогда
					Шаблон.Удалить(НайденнаяСтрока);	
					Продолжить;
				КонецЕсли;
				
				НайденнаяСтрока.КоличествоФакт = Строка.КоличествоОстаток;	
				НайденнаяСтрока.КоличествоУпаковокФакт = Строка.КоличествоОстаток;
				
			КонецЦикла;
			
		КонецЦикла;            
		
		ДокументОбъект.Товары.Очистить();
		ДокументОбъект.Товары.Загрузить(Шаблон); 
		
	ИначеЕсли ЭтоУНФ Тогда
		
		Шаблон = ДокументОбъект.Запасы.Выгрузить();
		
		Для каждого Строка Из ОстаткиТоваровВЯчейках Цикл
			
			ОтборЗапасы = Новый Структура();
			ОтборЗапасы.Вставить("Номенклатура", 	 Строка.Номенклатура); 
			ОтборЗапасы.Вставить("Характеристика", Строка.Характеристика); 
			
			Если ИспользуютсяСерии Тогда 
				ОтборСерии = Новый Структура();
				ОтборСерии.Вставить("Серия", Строка.Серия);
				НайденныеСтрокиСерий = ДокументОбъект.СерииНоменклатуры.НайтиСтроки(ОтборСерии); 
				
				Если НайденныеСтрокиСерий.Количество() <> 0 Тогда
					ОтборЗапасы.Вставить("КлючСвязи", НайденныеСтрокиСерий[0].КлючСвязи);  
				КонецЕсли;
					
			КонецЕсли;       
			
			НайденныеСтроки = Шаблон.НайтиСтроки(ОтборЗапасы); 
			
			Для каждого НайденнаяСтрока Из НайденныеСтроки Цикл
				
				Если НайденнаяСтрока.КоличествоУчет = 0 И Строка.КоличествоОстаток = 0 Тогда
					Шаблон.Удалить(НайденнаяСтрока);	
					Продолжить;
				КонецЕсли;     
				
				Если ОтборЗапасы.Свойство("КлючСвязи") Тогда	
					НайденнаяСтрока.Количество = НайденнаяСтрока.Количество + Строка.КоличествоОстаток;	
				Иначе
					НайденнаяСтрока.Количество = Строка.КоличествоОстаток;
				КонецЕсли;     
				
				НайденнаяСтрока.Отклонение = НайденнаяСтрока.Количество - НайденнаяСтрока.КоличествоУчет;  
				
			КонецЦикла;
			
		КонецЦикла;            
		
		ДокументОбъект.Запасы.Очистить();
		ДокументОбъект.Запасы.Загрузить(Шаблон);
		
	КонецЕсли;
	
	Попытка	 
		ДокументОбъект.Записать(); 
	Исключение
		ОбщегоНазначения.СообщитьПользователю(ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
		Возврат Ложь;
	КонецПопытки; 
	
	Возврат Истина;
	
КонецФункции

&НаСервере
Функция ТекстЗапросаТовары() 
	
	Если ЭтоУТ Тогда	
		
		ТекстЗапроса =	"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ПересчетТоваровТовары.Номенклатура КАК Номенклатура,
		|	ПересчетТоваровТовары.Характеристика КАК Характеристика,
		|   ВЫБОР КОГДА &ИспользуютсяСерии ТОГДА ПересчетТоваровТовары.Серия ИНАЧЕ ЗНАЧЕНИЕ(Справочник.СерииНоменклатуры.ПустаяСсылка) КОНЕЦ КАК Серия,
		|   ЕСТЬNULL(вмс_СоответствиеОбъектамУчета.ЗначениеВМС, ЗНАЧЕНИЕ(Справочник.вмс_СерииНоменклатуры.ПустаяСсылка)) КАК вмсСерия
		|ИЗ
		|	Документ.ПересчетТоваров.Товары КАК ПересчетТоваровТовары 
		|	ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.вмс_СоответствиеОбъектамУчета КАК вмс_СоответствиеОбъектамУчета 
		|		ПО (ПересчетТоваровТовары.Серия = вмс_СоответствиеОбъектамУчета.ЗначениеУчета)
		|ГДЕ
		|	ПересчетТоваровТовары.Ссылка = &Ссылка";
		
	ИначеЕсли ЭтоУНФ Тогда
		
		ТекстЗапроса = "ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ИнвентаризацияЗапасовЗапасы.Номенклатура КАК Номенклатура,
		|	ИнвентаризацияЗапасовЗапасы.Характеристика КАК Характеристика,
		|	ВЫБОР
		|		КОГДА &ИспользуютсяСерии
		|			ТОГДА ИнвентаризацияЗапасовСерииНоменклатуры.Серия
		|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.СерииНоменклатуры.ПустаяСсылка)
		|	КОНЕЦ КАК Серия
		|ПОМЕСТИТЬ ВТ_Запасы
		|ИЗ
		|	Документ.ИнвентаризацияЗапасов.Запасы КАК ИнвентаризацияЗапасовЗапасы
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ИнвентаризацияЗапасов.СерииНоменклатуры КАК ИнвентаризацияЗапасовСерииНоменклатуры
		|		ПО (ИнвентаризацияЗапасовЗапасы.Ссылка = ИнвентаризацияЗапасовСерииНоменклатуры.Ссылка)
		|			И (ИнвентаризацияЗапасовЗапасы.КлючСвязи = ИнвентаризацияЗапасовСерииНоменклатуры.КлючСвязи)
		|ГДЕ
		|	ИнвентаризацияЗапасовЗапасы.Ссылка = &Ссылка
		|;
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_Запасы.Номенклатура КАК Номенклатура,
		|	ВТ_Запасы.Характеристика КАК Характеристика,
		|	ВТ_Запасы.Серия КАК Серия,
		|	ЕСТЬNULL(вмс_СоответствиеОбъектамУчета.ЗначениеВМС, ЗНАЧЕНИЕ(Справочник.вмс_СерииНоменклатуры.ПустаяСсылка)) КАК вмсСерия
		|ИЗ
		|	ВТ_Запасы КАК ВТ_Запасы
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.вмс_СоответствиеОбъектамУчета КАК вмс_СоответствиеОбъектамУчета
		|		ПО ВТ_Запасы.Серия = вмс_СоответствиеОбъектамУчета.ЗначениеУчета";
		
	КонецЕсли;	
	
	Возврат ТекстЗапроса;			
	
КонецФункции 

&НаСервере
Функция ТекстЗапросаОстатковПоЯчейкам() 
	
	// ТУ_Прошин_13.01.26
	//Для инвентризации тоже склад, думаю, важен, поэтому оставляю из ячейки
	
	ТекстЗапроса = 
	"ВЫБРАТЬ
	|	ТаблицаТоваров.Номенклатура КАК Номенклатура,
	|	ТаблицаТоваров.Характеристика КАК Характеристика, 
	|	ТаблицаТоваров.Серия КАК Серия,
	|	ТаблицаТоваров.вмсСерия КАК вмсСерия 
	|ПОМЕСТИТЬ ВТ_Товары
	|ИЗ
	|	&ТаблицаТоваров КАК ТаблицаТоваров
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|&ОстаткиПоЯчейкам";	
	
	Если ИспользуютсяСерии Тогда
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&ОстаткиПоЯчейкам", "ВЫБРАТЬ
		|	ВТ_Товары.Номенклатура КАК Номенклатура, 
		|	ВТ_Товары.Характеристика КАК Характеристика,
		|	ВТ_Товары.Серия КАК Серия,
		|	СУММА(ЕСТЬNULL(вмс_ОперацияПоЯчейкамОстатки.КоличествоОстаток, 0)) КАК КоличествоОстаток	
		|ИЗ 
		|	ВТ_Товары КАК ВТ_Товары
		|	ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.вмс_ОперацияПоЯчейкам.Остатки(, Ячейка.Владелец = &Склад) КАК вмс_ОперацияПоЯчейкамОстатки 
		|	ПО ВТ_Товары.Номенклатура = вмс_ОперацияПоЯчейкамОстатки.Товар
		|		И  ВТ_Товары.Характеристика = вмс_ОперацияПоЯчейкамОстатки.Характеристика
		|			И ВТ_Товары.вмсСерия = вмс_ОперацияПоЯчейкамОстатки.Серия
		|СГРУППИРОВАТЬ ПО
		|	ВТ_Товары.Номенклатура,
		|	ВТ_Товары.Характеристика,
		|	ВТ_Товары.Серия"); 
	Иначе
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&ОстаткиПоЯчейкам", "ВЫБРАТЬ
		|	ВТ_Товары.Номенклатура КАК Номенклатура, 
		|	ВТ_Товары.Характеристика КАК Характеристика,
		|	СУММА(ЕСТЬNULL(вмс_ОперацияПоЯчейкамОстатки.КоличествоОстаток, 0)) КАК КоличествоОстаток	
		|ИЗ 
		|	ВТ_Товары КАК ВТ_Товары
		|	ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.вмс_ОперацияПоЯчейкам.Остатки(, Ячейка.Владелец = &Склад) КАК вмс_ОперацияПоЯчейкамОстатки 
		|	ПО ВТ_Товары.Номенклатура = вмс_ОперацияПоЯчейкамОстатки.Товар
		|		И  ВТ_Товары.Характеристика = вмс_ОперацияПоЯчейкамОстатки.Характеристика
		|СГРУППИРОВАТЬ ПО
		|	ВТ_Товары.Номенклатура,
		|	ВТ_Товары.Характеристика");	
	КонецЕсли;	
	
	Возврат ТекстЗапроса;			
	
КонецФункции

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если вмс_АдаптацияКонфигураций.ЭтоУТ() Тогда
		Элементы.ДокументОснование.ОграничениеТипа = Новый ОписаниеТипов("ДокументСсылка.ПересчетТоваров"); 
		ИспользуютсяСерии = вмс_АдаптацияКонфигурацийУТ.ИспользуютсяСерии(); 
		ЭтоУТ = Истина;
	ИначеЕсли вмс_АдаптацияКонфигураций.ЭтоУНФ() Тогда
		Элементы.ДокументОснование.ОграничениеТипа = Новый ОписаниеТипов("ДокументСсылка.ИнвентаризацияЗапасов");
		ИспользуютсяСерии = вмс_АдаптацияКонфигурацийУНФ.ИспользуютсяСерии();  
		ЭтоУНФ = Истина;
	КонецЕсли;
КонецПроцедуры
